// start--------------------------------------------------------------------------------------------------------------------------------

// Задайте массив из 10 элементов, заполненный числами из
// промежутка [-10, 10]. Замените отрицательные элементы на
// положительные, а положительные на отрицательные.



Console.WriteLine("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine());
int[] mas = new int[n];


// задал масив из 10----------------------------------------------------------------------------------

void Print_mas(int[] col)
{
for (int i = 0; i < col.Length; i++)
{
    Console.Write($"{col[i]}\t");
}
Console.WriteLine();
}

Print_mas(mas);

// заполнил массив числами из промежутка заданного-------------------------------------------------------------------------------------

int[] Random_mas(int[] col)
{
    for (int i = 0; i < col.Length; i++)
    {
        col[i] = new Random().Next(-10,10);
    }
    return col;
}


Print_mas(Random_mas(mas));


// заменить числа отрицательные на положительные и наобород-------------------------------------------------------------------------------------


Random_mas(mas);






